// types
import { Card, Link } from "@/types/layout";

// lucide icons
import {
  UserCheck,
  NotebookPen,
  Speech,
  Banknote,
  ShieldCheck,
  BadgeCheck,
  Drama,
  MapPinned,
  PhoneCall,
  Mail,
} from "lucide-react";

// contact us info
export const contactUs: Link[] = [
  { label: "السعودية – الرياض", icon: MapPinned, link: "" },
  { label: "0554117879", icon: PhoneCall, link: "https://wa.me/966554117879" },
  {
    label: "support@shwerni.com",
    icon: Mail,
    link: "mailto:support@shwerni.com",
  },
];

// consultants terms
export const ownerTerms: string[] = [
  "منصة شاورني غير مسؤولة بأي حال من الأحوال عن الأضرار العرضية أو المباشرة وغير المباشرة وما يتبعها من تبعات بعد تقديم الاستشارة للمستفيد.",
  "استخدام المنصة والعمليات التي تتم بإسم المستفيد بواسطة حسابه الخاص به هي مسؤوليته والمنصة تخلي مسؤوليتها تجاه ذلك.",
  "يتولى المختص تقديم الاستشارة بنفسه بعد اختياره من قبل المستفيد، وذلك بعد سداد المستفيد مبلغ الاستشارة حسب ما هو مذكور أمام أيقونة المختص.",
  "عند التسجيل في منصة شاورني يجب تسجيل البيانات والمعلومات الشخصية على المنصة بشكل صحيح و المصداقية في ذلك , و في حال تببين غير ذلك من غش أو تزوير او تدليس يحق للمنصة إلغاء الحساب.",
  "في حال طرأ تحديث المعلومات يجب على المختص إبلاغ إدارة المنصة بذلك والقيام بتحديث البيانات ومعلومات الحساب الخاص به على المنصة.",
  "المستشار القانوني ينبغي عليه الإلمام بالأنظمة واللوائح في المملكة العربية السعودية والمحافظة على أخلاقيات المهنة وفق الأنظمة واللوائح الواردة في نظام المحاماة.",
  "تعهد المختص بعدم إفشاء أسرار المستفيدين في موضوع الاستشارة سواء كان خلال مدة تقديم الاستشارة أو بعد الانتهاء منها وترك المنصة.",
  "على المختص أن يلتزم بالوقت المحدد لتقديم الاستشارة وفي حال حدث تأخير أو إلغاء أو إعادة جدولة لموعد المستفيد فيجب إبلاغ المستفيد والمنصة بذلك قبل موعد الاستشارة بوقت لا يقل عن ثلاث ساعات.",
  "إذا واجهت المختص مشكلة تقنية في حسابه أو في حال اختراق الحساب لا سمح الله أو استخدام غير مصرح به على حسابه الخاص به واحتاج طلب المساعدة بشأنها ينبغي عليه حينئذ الاتصال بالدعم الفني.",
  "يتم التحويل التكاليف المالية للاستشارات المقدمة من المنصة بعد خصم نسبة المنصة نهاية كل شهر ميلادي من تاريخ التسجيل في المنصبة على الحساب البنكي الخاص بالمختص.",
  "نسبة المنصة من كل قيمة استشارة تمثل 40% ، ونسبة المستشار تمثل 60%.",
  "عند عدم الرغبة في الاستمرار في المنصة ينبغي إبلاغ المنصة بذلك خلال أسبوع لاتخاذ الإجراءات اللازمة حيال ذلك. ",
  "في حال عدم الالتزام بالشروط والأحكام أو عدم الإلتزام بالمواعيد وتكرر ذلك عدة مرات أو وجود شكوى من الطرف الآخر وبعد التحقق منها يحق للمنصة إلغاء الحساب دون إشعار مسبق بذلك واتخاذ الإجراء اللازم بحقه.",
  "في حال أراد المختص تغيير قيمة الجلسة فعليه ابلاغ إدارة المنصة بذلك.",
  "يحق لإدارة المنصة تعديل الشروط والأحكام في أي وقت، دون إشعار مسبق.",
  "في حال حدوث نزاع بين الطرفين أو خلافات (لا قدر الله) تنشأ عن هذه الشروط أو تنفيذها يتم الرجوع فيها إلى الأنظمة واللوائح في المملكة العربية السعودية",
];

// client terms
export const clientTerms: string[] = [
  "منصة شاورني غير مسؤولة بأي حال من الأحوال عن الأضرار العرضية أو المباشرة أو غير المباشرة وما يتبعها من تبعات بعد تقديم الاستشارة للمستفيد.",
  "استخدام المنصة والعمليات التي تتم بإسم المستفيد بواسطة حسابه الخاص بك هي مسؤوليته والمنصة تخلي مسؤوليتها تجاه ذلك.",
  "عند التسجيل في منصة شاورني يجب تسجيل البيانات والمعلومات الشخصية على المنصة بشكل صحيح والمصداقية في ذلك , و في حال تببين غير ذلك من غش أو تزوير او تدليس يحق للمنصة إلغاء الحساب.",
  "في حال طرأ تحديث لمعلوماتك يجب عليك إبلاغ إدارة المنصة بذلك والقيام بتحديث بيانات ومعلومات الحساب الخاص بك على المنصة.",
  "يتوجب على المستفيد عند طرح الاستشارة المصداقية والوضوح التام مع المستشار، حتى يتمكن من تقديم الاستشارة بشكل صحيح وسليم بما يتناسب مع الحالة. ",
  "أن يكون المستفيد يتمتع بالأهلية المعتبرة شرعاً ونظاماً للتعاقد والتعامل وأن لا يقل  العمر عن (18) ثمانية عشر عاماً.",
  "إذا واجهت المستفيد مشكلة تقنية في حسابه أو في حال اختراق الحساب لا سمح الله أو استخدام غير مصرح به على حسابه الخاص به واحتاج طلب المساعدة بشأنها ينبغي عليه حينئذ الاتصال بالدعم الفني.",
  "يجوز للمختص التغيير في سعر الجلسة متى أراد ذلك، وسيتم تحديث الجلسة بناءً على التغيير الحاصل.",
  "في حال عدم الالتزام بالشروط والأحكام أو عدم الإلتزام بالمواعيد وتكرر ذلك عدة مرات أو وجود شكوى من الطرف الآخر وبعد التحقق منها  يحق للمنصة إلغاء الحساب دون إشعار مسبق بذلك  واتخاذ الإجراء اللازم بحقه.",
  "يحق لإدارة المنصة تعديل الشروط والأحكام في أي وقت، دون إشعار مسبق.",
  "في حال حدوث نزاع بين الطرفين أو خلافات (لا قدر الله) تنشأ عن هذه الشروط أو تنفيذها يتم الرجوع فيها إلى الأنظمة واللوائح في المملكة العربية السعودية",
];

// refund terms
export const refundTerms: string[] = [
  "يتم دفع التكاليف المالية للإستشارات بعد اختيار المستشار وتحديد وقت الاستشارة , وفي حال تخلف المختص عن تقديم الاستشارة بسبب التأخير أو الإلغاء أو إعادة الجدولة من غير إبلاغ مسبق فيحق للمستفيد حينئذ استرداد كامل الرسوم المدفوعة بعد اطلاع المنصة بمشكلته خلال 48 ساعة .",
  "في حال حصل ظرف طاريء للمستفيد ولم يحضر الجلسة فيجب عليه ابلاغ المختص والمنصة بوقت",
  "لا يقل عن ست ساعات لإلغاء موعد الاستشارة  و يبقى المبلغ في محفظة المستفيد لمدة 60 يوماً",
  "في حال لم يتمكن المستفيد من الحصول على الاستشارة لظرف أو خلل تقني يبقى المبلغ في محفظة المستفيد لمدة 60 يوماً.",
];

// social media links
export const socialMedia: Link[] = [
  {
    label: "twitter",
    icon: "twitter.svg",
    link: "https://twitter.com/shwernisa",
  },
  {
    label: "instagram",
    icon: "instagram.svg",
    link: "https://www.instagram.com/shwernisa/",
  },
  {
    label: "whatsapp",
    icon: "whatsapp.svg",
    link: "https://wa.me/966554117879?text=%D8%A7%D9%84%D8%B3%D9%84%D8%A7%D9%85%20%D8%B9%D9%84%D9%8A%D9%83%D9%85%D8%8C%20%D8%A3%D8%AD%D8%AA%D8%A7%D8%AC%20%D9%84%D9%84%D8%A7%D8%B3%D8%AA%D9%81%D8%B3%D8%A7%D8%B1%20%D8%B9%D9%86%20%D8%B4%D9%8A%D8%A1%20%D8%A8%D8%AE%D8%B5%D9%88%D8%B5%20%D8%B4%D8%A7%D9%88%D8%B1%D9%86%D9%8A",
  },
  {
    label: "tiktok",
    icon: "tiktok.svg",
    link: "https://www.tiktok.com/@shwerni?_t=ZS-8scPxSUGmLB&_r=1",
  },
  {
    label: "snapchat",
    icon: "snapchat.svg",
    link: "https://snapchat.com/t/9s6HcSQY",
  },
];

// payments
export const paymentsFooter: Link[] = [
  {
    label: "visa",
    icon: "visa.svg",
    link: "",
  },
  {
    label: "mastercard",
    icon: "mastercard.svg",
    link: "",
  },
  {
    label: "amex",
    icon: "amex.svg",
    link: "",
  },
  {
    label: "mada",
    icon: "mada.svg",
    link: "",
  },
  {
    label: "apple pay",
    icon: "applepay.svg",
    link: "",
  },
  {
    label: "payPal",
    icon: "paypal.svg",
    link: "",
  },
  {
    label: "tabby",
    icon: "tabby.svg",
    link: "",
  },
];

// home frequent questions
export const frequentQuestions: Card[] = [
  {
    title: "كيف أجد المختص المناسب؟",
    desc: "عن طريق الفلاتر، بإمكانك تحديد المشكلة التي تبحث عن حل لها، السعر المناسب لك، ونوع المختص.",
  },
  {
    title: "ما هي طريقة التواصل مع المختصين؟",
    desc: "يمكنك التواصل مع المختصين عبر رسائل الواتساب أو الاتصال الهاتفي أو مكالمة مرئية عبر تطبيق Zoom.",
  },
  {
    title: "ما هي طريقة طلب استشارة؟",
    desc: "عند دخولك لمنصة شاورني، وإنشاء حساب خاص بك، ثم الدخول على صفحة المختصين وبعدها اختيار المختص المناسب، ومن ثم حجز جلسة بعد ذلك، تواصل بكل خصوصية مع المختص في صفحة المواعيد عبر الشات او الاتصال الصوتي او الفيديو بعدها تقييم الجلسة.",
  },
  {
    title: "هل يمكن أن أسجل كمستشار ضمن منصة شاورني؟",
    desc: "نعم، وبكل تأكيد يمكنك مضاعفة دخلك المادي عبر تقديم الاستشارات في شاورني، وستجد هنا ",
  },
  {
    title: "هل منصة شاورني مرخصة؟",
    desc: "نعم، مؤسسة سعودية مسجلة في وزارة التجارة والاستثمار.",
  },
  {
    title: "كم تكلفة الاستشارة ؟",
    desc: "للاستشارات يوجد  ثلاث مدد بإمكانك اختيار إحداها (٣٠ دقيقة – ٤٥ دقيقة – ٦٠ دقيقة ) وبناء عليه يتم تحديد رسوم الاستشارة التي تبدأ لدينا من مبلغ وقدره (٨٩) ريالاً .",
  },
  {
    title: "ماهي خيارات الدفع المتوفرة في شاورني؟",
    desc: "خيارات الدفع  متعددة و هي: مدى – أبل باي – فيزا – ماستر كارد – التقسيط عبر تابي ـ التحويل المباشر لحساب المنصة .",
  },
  {
    title: "هل يمكن أقسط تكلفة الاستشارة ؟",
    desc: "نعم، يمكن تقسيطها  من خلال خدمة تابي للتقسيط",
  },
  {
    title: "كيف أكون مهيأ للاستشارة؟",
    desc: `أولاً: احرص على اختيار وقت مناسب لك في مكان مهياً لا يوجد فيه اي شواغل ذهنية .
ثانيا : احرص على اختيار مستشار مناسب احتياجك فمدون لدى كل مستشار تخصصه ومؤهلاته وخبراته .
ثالثاً :  عندما تحجز استشارة، هناك مربع لكتابة شرح موجز للاستشارة، لكي يتمكن المستشار من فهم استشارتك والاستعداد بشكل أفضل.`,
  },
];