// types
import { Card, Link } from "@/types/layout";

// lucide icons
import {
  UserCheck,
  NotebookPen,
  Speech,
  Banknote,
  ShieldCheck,
  BadgeCheck,
  Drama,
  MapPinned,
  PhoneCall,
  Mail,
} from "lucide-react";

// how to use our platform
export const usageSteps: Card[] = [
  {
    title: "اختر المستشار المناسب",
    desc: "من بين تخصصات منصة شاورني قم بإختيار الخبير المناسب لتقديم المشورة لك ",
    icon: UserCheck,
  },
  {
    title: "قم بالتسجيل والحجز",
    desc: "قم حجز وقت الاستشارة المناسب لك وقم بإكمال التسجيل والدفع",
    icon: NotebookPen,
  },
  {
    title: "سيتواصل معك المستشار عبر الوسيلة التي تناسبك",
    desc: "سيتواصل معك المستشار في الوقت الذي اخترته عبر برنامج قوقل ميت (google meet)",
    icon: Speech,
  },
];

// why us
export const whyus: Card[] = [
  {
    title: "أمان أكثر",
    desc: "ندرك أن الاستشارات تتطلب من عملاءئنا إعطاء معلومات بالغة الخصوصية، لذا وحرصاً على خصوصيتكم فجميع مستشارينا ملزمون بإتفاقيات قانونية تضمن حقظ خصوصية العملاء",
    icon: ShieldCheck,
  },
  {
    title: "مستشارين مميزين",
    desc: "تم انتقاء نخبة من أكفأ المستشارين السعوديين المتخصصين في المجال الأسري لتقديم مشورة ذات قيمة عالية خدمة تترك أثراً ملموساً في قرارت العميل",
    icon: BadgeCheck,
  },
  {
    title: "أسعار أفضل",
    desc: "رؤية شاورني هي تقديم أعلى قيمة بأقل سعر ممكن. تختلف الاسعار في منصة شاورني بين مستشار وآخر لكنها تتفق في أنها من بين الأسعار الأكثر تنافسية في السوق المحلي",
    icon: Banknote,
  },
];

// contact us data
export const contactUsData: string[] = [
  "شاورني هي منصة تقدم خدمة الربط بين طالبي المشورة ومقدميها.",
  "شاورني هي إحدى خدمات مكتب مشاورة للخدمات التجارية.",
];

// contact us info
export const contactUs: Link[] = [
  { label: "السعودية – الرياض", icon: MapPinned, link: "" },
  { label: "0554117879", icon: PhoneCall, link: "wa.me/966554117879" },
  {
    label: "support@shwerni.com",
    icon: Mail,
    link: "mailto:support@shwerni.com",
  },
];

// consultants terms
export const ownerTerms: string[] = [
  "منصة شاورني غير مسؤولة بأي حال من الأحوال عن الأضرار العرضية أو المباشرة وغير المباشرة وما يتبعها من تبعات بعد تقديم الاستشارة للمستفيد.",
  "استخدام المنصة والعمليات التي تتم بإسم المستفيد بواسطة حسابه الخاص به هي مسؤوليته والمنصة تخلي مسؤوليتها تجاه ذلك.",
  "يتولى المختص تقديم الاستشارة بنفسه بعد اختياره من قبل المستفيد، وذلك بعد سداد المستفيد مبلغ الاستشارة حسب ما هو مذكور أمام أيقونة المختص.",
  "عند التسجيل في منصة شاورني يجب تسجيل البيانات والمعلومات الشخصية على المنصة بشكل صحيح و المصداقية في ذلك , و في حال تببين غير ذلك من غش أو تزوير او تدليس يحق للمنصة إلغاء الحساب.",
  "في حال طرأ تحديث المعلومات يجب على المختص إبلاغ إدارة المنصة بذلك والقيام بتحديث البيانات ومعلومات الحساب الخاص به على المنصة.",
  "المستشار القانوني ينبغي عليه الإلمام بالأنظمة واللوائح في المملكة العربية السعودية والمحافظة على أخلاقيات المهنة وفق الأنظمة واللوائح الواردة في نظام المحاماة.",
  "تعهد المختص بعدم إفشاء أسرار المستفيدين في موضوع الاستشارة سواء كان خلال مدة تقديم الاستشارة أو بعد الانتهاء منها وترك المنصة.",
  "على المختص أن يلتزم بالوقت المحدد لتقديم الاستشارة وفي حال حدث تأخير أو إلغاء أو إعادة جدولة لموعد المستفيد فيجب إبلاغ المستفيد والمنصة بذلك قبل موعد الاستشارة بوقت لا يقل عن ثلاث ساعات.",
  "إذا واجهت المختص مشكلة تقنية في حسابه أو في حال اختراق الحساب لا سمح الله أو استخدام غير مصرح به على حسابه الخاص به واحتاج طلب المساعدة بشأنها ينبغي عليه حينئذ الاتصال بالدعم الفني.",
  "يتم التحويل التكاليف المالية للاستشارات المقدمة من المنصة بعد خصم نسبة المنصة نهاية كل شهر ميلادي من تاريخ التسجيل في المنصبة على الحساب البنكي الخاص بالمختص.",
  "نسبة المنصة من كل قيمة استشارة تمثل 40% ، ونسبة المستشار تمثل 60%.",
  "عند عدم الرغبة في الاستمرار في المنصة ينبغي إبلاغ المنصة بذلك خلال أسبوع لاتخاذ الإجراءات اللازمة حيال ذلك. ",
  "في حال عدم الالتزام بالشروط والأحكام أو عدم الإلتزام بالمواعيد وتكرر ذلك عدة مرات أو وجود شكوى من الطرف الآخر وبعد التحقق منها يحق للمنصة إلغاء الحساب دون إشعار مسبق بذلك واتخاذ الإجراء اللازم بحقه.",
  "في حال أراد المختص تغيير قيمة الجلسة فعليه ابلاغ إدارة المنصة بذلك.",
  "يحق لإدارة المنصة تعديل الشروط والأحكام في أي وقت، دون إشعار مسبق.",
  "في حال حدوث نزاع بين الطرفين أو خلافات (لا قدر الله) تنشأ عن هذه الشروط أو تنفيذها يتم الرجوع فيها إلى الأنظمة واللوائح في المملكة العربية السعودية",
];

// client terms
export const clientTerms: string[] = [
  "منصة شاورني غير مسؤولة بأي حال من الأحوال عن الأضرار العرضية أو المباشرة أو غير المباشرة وما يتبعها من تبعات بعد تقديم الاستشارة للمستفيد.",
  "استخدام المنصة والعمليات التي تتم بإسم المستفيد بواسطة حسابه الخاص بك هي مسؤوليته والمنصة تخلي مسؤوليتها تجاه ذلك.",
  "عند التسجيل في منصة شاورني يجب تسجيل البيانات والمعلومات الشخصية على المنصة بشكل صحيح والمصداقية في ذلك , و في حال تببين غير ذلك من غش أو تزوير او تدليس يحق للمنصة إلغاء الحساب.",
  "في حال طرأ تحديث لمعلوماتك يجب عليك إبلاغ إدارة المنصة بذلك والقيام بتحديث بيانات ومعلومات الحساب الخاص بك على المنصة.",
  "يتوجب على المستفيد عند طرح الاستشارة المصداقية والوضوح التام مع المستشار، حتى يتمكن من تقديم الاستشارة بشكل صحيح وسليم بما يتناسب مع الحالة. ",
  "أن يكون المستفيد يتمتع بالأهلية المعتبرة شرعاً ونظاماً للتعاقد والتعامل وأن لا يقل  العمر عن (18) ثمانية عشر عاماً.",
  "إذا واجهت المستفيد مشكلة تقنية في حسابه أو في حال اختراق الحساب لا سمح الله أو استخدام غير مصرح به على حسابه الخاص به واحتاج طلب المساعدة بشأنها ينبغي عليه حينئذ الاتصال بالدعم الفني.",
  "يجوز للمختص التغيير في سعر الجلسة متى أراد ذلك، وسيتم تحديث الجلسة بناءً على التغيير الحاصل.",
  "في حال عدم الالتزام بالشروط والأحكام أو عدم الإلتزام بالمواعيد وتكرر ذلك عدة مرات أو وجود شكوى من الطرف الآخر وبعد التحقق منها  يحق للمنصة إلغاء الحساب دون إشعار مسبق بذلك  واتخاذ الإجراء اللازم بحقه.",
  "يحق لإدارة المنصة تعديل الشروط والأحكام في أي وقت، دون إشعار مسبق.",
  "في حال حدوث نزاع بين الطرفين أو خلافات (لا قدر الله) تنشأ عن هذه الشروط أو تنفيذها يتم الرجوع فيها إلى الأنظمة واللوائح في المملكة العربية السعودية",
];

// refund terms
export const refundTerms: string[] = [
  "يتم دفع التكاليف المالية للإستشارات بعد اختيار المستشار وتحديد وقت الاستشارة , وفي حال تخلف المختص عن تقديم الاستشارة بسبب التأخير أو الإلغاء أو إعادة الجدولة من غير إبلاغ مسبق فيحق للمستفيد حينئذ استرداد كامل الرسوم المدفوعة بعد اطلاع المنصة بمشكلته خلال 48 ساعة .",
  "في حال حصل ظرف طاريء للمستفيد ولم يحضر الجلسة فيجب عليه ابلاغ المختص والمنصة بوقت",
  "لا يقل عن ست ساعات لإلغاء موعد الاستشارة  و يبقى المبلغ في محفظة المستفيد لمدة 60 يوماً",
  "في حال لم يتمكن المستفيد من الحصول على الاستشارة لظرف أو خلل تقني يبقى المبلغ في محفظة المستفيد لمدة 60 يوماً.",
];

// social media links
export const socialMedia: Link[] = [
  {
    label: "twitter",
    icon: "twitter.svg",
    link: "https://twitter.com/shwernisa",
  },
  {
    label: "instagram",
    icon: "instagram.svg",
    link: "https://www.instagram.com/shwernisa/",
  },
  {
    label: "whatsapp",
    icon: "whatsapp.svg",
    link: "https://wa.me/966554117879",
  },
  {
    label: "tiktok",
    icon: "tiktok.svg",
    link: "https://www.tiktok.com/@shwerni?_t=ZS-8scPxSUGmLB&_r=1",
  },
  {
    label: "snapchat",
    icon: "snapchat.svg",
    link: "https://snapchat.com/t/9s6HcSQY",
  },
];

// payments
export const paymentsFooter: Link[] = [
  {
    label: "visa",
    icon: "visa.svg",
    link: "",
  },
  {
    label: "mastercard",
    icon: "mastercard.svg",
    link: "",
  },
  {
    label: "amex",
    icon: "amex.svg",
    link: "",
  },
  {
    label: "mada",
    icon: "mada.svg",
    link: "",
  },
  {
    label: "apple pay",
    icon: "applepay.svg",
    link: "",
  },
  {
    label: "payPal",
    icon: "paypal.svg",
    link: "",
  },
  {
    label: "tabby",
    icon: "tabby.svg",
    link: "",
  },
];

// information
export const information: Card[] = [
  {
    title: "العلاج بالقبول والالتزام",
    subTitle: "أسري",
    desc: `نوع من العلاج المعرفي السلوكي ، تتعلم فيه كيف تقلل ارتباطك العاطفي بأفكارك وتعرف انها مجرد أفكار قد تهدم حياتك الزوجية سواء شك او وساوس او غير ذلك …
كل ماتحتاجه هو مناقشة مشاعرك بدلاً من تجاهلها أو الهروب منها ..مهمتنا هي مساعدتك في وضوح المشاعر والسيطرة عليها`,
    icon: Drama,
  },
  {
    title: "نمط التعلق في العلاقة الزوجية",
    subTitle: "أسري",
    desc: `الطريقة التي تؤثر في العلاقات وتتشكل منذ الطفولة
اعتماداً على الطريقة التي كان المسئولون عن رغباتك يتفاعلون بها معك ومنها ( التعلق القلق - التجنبي- المشوش - الآمن ) 
وأكثرها خطراً التعلق القلق والتجنبي هي غير آمنة في العلاقات ، نساعدك على اكتشافها والتخلص منها

الاعتمادية المشتركة بين الزوجين 
الاعتماد الغير صحي في العلاقات وعلى شريك العلاقة 
هنا تشعر وكأنك مسؤل عن مشاعر الآخرين او مشكلاتهم وقد تعتمد بصورة مبالغة فيها على الشريك
نساعدك من اجل الوصول إلى الثبات العاطفي والاحساس بالهدف والكشف عن السلوك الإدماني أو المؤذي`,
    icon: "wholefamily.svg",
  },
  {
    title: "السيطرة القسرية",
    subTitle: "أسري",
    desc: `ممنوعة تماماً في العلاقات لأنها مدمرة .. وهي تصف الإساءة والايذاء أو معاقبة شخص أو الشجار معه . وتشمل 
( التهديد ، التخويف ، الإذلال ، الإعتداء ) وكل ذلك يعتبر جريمة جنائيه

العلاج الأسري
صوره من صور العلاج بالتحدث ، هنا يلتقي الشريكان تحت ظل الاستشارات الاسرية والزوجية لمناقشة المشكلات الحالية والسابقة في كلاهما ، وقد يعقد المعالج جلسة فردية مع كل شريك على حدة في بداية العلاج حتى تصل العلاقة إلى نتائج مثمرة .

العلاج المعرفي السلوكي
هو نوع من العلاج بالتحدث نركز فيه بشكل جزئي على التعرف على تشوهات التفكير وتغييرها ( الحوار الداخلي الخاطئ) وعندما يتغير هذا الحوار يتغير السلوك تجاه نفسك والآخرين`,
    icon: "brain4.svg",
  },
  {
    title: "التنافر المعرفي في الحوار الزواجي",
    subTitle: "أسري",
    desc: `يحدث عندما يتلقى احدهما اساليب وفرضيات تتناقض مع معتقداته ولا تتلائم معه ومع محيطه وفكره ووعيه
ومن الممكن ان يؤدي هذا التنافر إلى مشاعر القلق والاكتئاب والرفض وعدم الاستجابة`,
    icon: Drama,
  },
  {
    title: "الإجهاد في العلاقات",
    subTitle: "أسري",
    desc: `صدمات الخيانة وغيرها والتوتر الثانًوي الناتج عنها ، هذا التأثير سيستنزف عقليتك وقدرتك على الاستمرار والتعاطف مع الشريك والآخرين .سيرتفع مستوى التوتر والانفعال لديك وتتغير في العلاقة بطريقة ملحوظة . بالتالي إرهاق . اجهاد . اعراض نفسية وجسدية . الحل اطلب استشارة عاجلة وفورية`,
    icon: "brain3.svg",
  },
  {
    title: "انقاص القيمة في العلاقات",
    subTitle: "أسري",
    desc: `اختفاء المثالية والرفض التي يمارسها الشخص السام في العلاقة ويحدث الإنقاص عندما يعاملك الشخص السام كما لو انك بلا قيمة او غير مهم ، فيكثر من نقده لك ، ويلومك على اخطاء لم يرتكبها . الحل هو تحديد نمط العلاقة ونمط التعلق وكيفية ادارة الحياة مع الشريك بشكل متقدم وناجح`,
    icon: Drama,
  },
  {
    title: "الابتزاز العاطفي في العلاقات",
    subTitle: "أسري",
    desc: `هو نوع من التلاعب يستخدم فيه الشخص السام الشعور بالذنب او الخزي او التهديدات لكي يسيطر في العلاقة  وامي يتم تلبية احتياجاته من الطرف الآخر . كالتهديد بالاذى النفسي في حين التخلي .. اطلب المساعدة فوراً`,
    icon: Drama,
  },
  {
    title: "النرجسية في العلاقات",
    subTitle: "أسري",
    desc: `الأنانية والاحساس بالاستحقاق. لدرجة تجعل الشخص لا يأخذ احتياجات الآخرين في اعتباره . ربما يتم تشخيص الشخص النرجسي باضطراب الشخصية النرجسية المنسجمة مع الأنا التي تعاني من صعوبة في تكوين علاقات صحية 
ويعتقد بأنه يستحق معاملة ( خاصة ) واستغلال الآخرين ونقص التعاطف معهم`,
    icon: Drama,
  },
  {
    title: "دور العوامل الاجتماعية في جودة الحياة: منظور حديث",
    subTitle: "أسري",
    desc: `ما هي جودة الحياة؟
جودة الحياة ليست فقط مرتبطة بالراحة المادية، بل تشمل الرفاه النفسي، العلاقات الاجتماعية، الصحة، والرضا عن الحياة.

 العوامل الاجتماعية وتأثيرها:

الدعم الاجتماعي: وجود شبكة داعمة من الأصدقاء والعائلة يعزز الصحة النفسية والرضا العام.
العمل الجماعي: بيئة العمل الإيجابية التي تعزز التعاون والثقة تزيد من جودة حياة الموظفين.
العدالة الاجتماعية: المساواة في الحقوق والفرص تقلل من التوتر وتعزز الانتماء المجتمعي.
 كيف تعزز جودة حياتك اجتماعيًا؟

بناء علاقات إيجابية: خصص وقتًا لتقوية الروابط مع الأشخاص الذين يدعمونك.
المساهمة المجتمعية: التطوع أو المشاركة في مبادرات اجتماعية يعزز شعورك بالانتماء.
التواصل الفعّال: استمع للآخرين وتفاعل معهم بطريقة صادقة ومحترمة.
✨ النقطة الأهم: العلاقات الاجتماعية ليست مجرد رفاهية، بل هي ضرورة لتحسين جودة الحياة على جميع المستويات. فكر في تأثير دعمك للآخرين وفي بناء بيئة اجتماعية صحية.`,
    icon: Drama,
  },
];

// home frequent questions
export const frequentQuestions: Card[] = [
  {
    title: "كيف أجد المختص المناسب؟",
    desc: "عن طريق الفلاتر، بإمكانك تحديد المشكلة التي تبحث عن حل لها، السعر المناسب لك، ونوع المختص.",
  },
  {
    title: "ما هي طريقة التواصل مع المختصين؟",
    desc: "يمكنك التواصل مع المختصين عبر رسائل الواتساب أو الاتصال الهاتفي أو مكالمة مرئية عبر تطبيق Zoom.",
  },
  {
    title: "ما هي طريقة طلب استشارة؟",
    desc: "عند دخولك لمنصة شاورني، وإنشاء حساب خاص بك، ثم الدخول على صفحة المختصين وبعدها اختيار المختص المناسب، ومن ثم حجز جلسة بعد ذلك، تواصل بكل خصوصية مع المختص في صفحة المواعيد عبر الشات او الاتصال الصوتي او الفيديو بعدها تقييم الجلسة.",
  },
  {
    title: "هل يمكن أن أسجل كمستشار ضمن منصة شاورني؟",
    desc: "نعم، وبكل تأكيد يمكنك مضاعفة دخلك المادي عبر تقديم الاستشارات في شاورني، وستجد هنا ",
  },
  {
    title: "هل منصة شاورني مرخصة؟",
    desc: "نعم، مؤسسة سعودية مسجلة في وزارة التجارة والاستثمار.",
  },
  {
    title: "كم تكلفة الاستشارة ؟",
    desc: "للاستشارات يوجد  ثلاث مدد بإمكانك اختيار إحداها (٣٠ دقيقة – ٤٥ دقيقة – ٦٠ دقيقة ) وبناء عليه يتم تحديد رسوم الاستشارة التي تبدأ لدينا من مبلغ وقدره (٨٩) ريالاً .",
  },
  {
    title: "ماهي خيارات الدفع المتوفرة في شاورني؟",
    desc: "خيارات الدفع  متعددة و هي: مدى – أبل باي – فيزا – ماستر كارد – التقسيط عبر تابي ـ التحويل المباشر لحساب المنصة .",
  },
  {
    title: "هل يمكن أقسط تكلفة الاستشارة ؟",
    desc: "نعم، يمكن تقسيطها  من خلال خدمة تابي للتقسيط",
  },
  {
    title: "كيف أكون مهيأ للاستشارة؟",
    desc: `أولاً: احرص على اختيار وقت مناسب لك في مكان مهياً لا يوجد فيه اي شواغل ذهنية .
ثانيا : احرص على اختيار مستشار مناسب احتياجك فمدون لدى كل مستشار تخصصه ومؤهلاته وخبراته .
ثالثاً :  عندما تحجز استشارة، هناك مربع لكتابة شرح موجز للاستشارة، لكي يتمكن المستشار من فهم استشارتك والاستعداد بشكل أفضل.`,
  },
];