"use client";
import React from 'react';
import { useRouter } from 'next/navigation';

// components
import { Label } from '@/components/ui/label';
import { Button } from '@/components/ui/button';
import { Checkbox } from '@/components/ui/checkbox';
import { Separator } from '@/components/ui/separator';

// icons
import { Ban, Save, TriangleAlert } from 'lucide-react';
import { confirmOathAcceptance } from '@/data/admin/tools/oath';
import LoadingBtn from '@/app/_components/layout/loadingBtn';
import { ZToast } from '@/app/_components/layout/toasts';

function ConsultantOath({ id }: { id: string }) {
    const router = useRouter();
    const [agree, setAgree] = React.useState(false);
    const [isPending, startTransition] = React.useTransition();

    const terms = [
        "على المستشار إظهار الاحترام والتقدير للعملاء، مع صون وتعزيز شرف كل عميل وأحقيته ومسؤوليته كإنسان فرد، بغض النظر عن اختلاف ثقافته.",
        "إعطاء اعتبار لقيم ومعتقدات وثقافات وأهداف وحاجات ورغبات العملاء.",
        "احترام حقوق الناس وأفكارهم ورؤاهم حتى وإن اختلفت عن المعتاد.",
        "احترام حق العميل في اتخاذ القرار الذي يراه مناسباً لحياته، واحترام حقه في مدى قبول الخدمة والخيارات الأخرى ذات العلاقة.",
        "تعزيز السياسات والممارسات والأوضاع الاجتماعية التي تؤكد على حقوق الإنسان وتضمن العدالة والتواصل والمشاركة بين ومن قبل الجميع.",
        "ممارسة الاستشارة بدون أي تفرقة عنصرية أو تحيز لأفراد أو جماعات أو مجتمعات، بغض النظر عن اللون، والسلالة، والجنس، والديانة، واللغة، ومكان الولادة والنشأة، والجنسية، والمعتقدات الشخصية والسياسية، والوضع الاجتماعي والصحي والزواجي.",
        "تعزيز المشاركات العامة من أجل تطوير وتحقيق الخدمات والسياسات الاجتماعية.",
        "تقديم خدمات الاستشارة بشكل متخصص وبطريقة واعية وإيصالها إلى المحتاجين.",
        "تقديم الاستشارة للعملاء بطريقة موضوعية تضمن إشباع الحاجات وتحقق المساواة بين المستفيدين، فيما يتعلق بالحصول على الخدمات وفرص المشاركة، ثم تحقيق العيش الكريم.",
        "ضمان مشاركة العملاء في صياغة عمليات الاستشارة وتنفيذها، بما يضمن الرضى وتحقيق المنفعة، في ظل عدم الإضرار بمنافع الآخرين.",
        "ضمان تقديم الاستشارة بشكل يتناسب مع ثقافة المستفيدين.",
        "في حالات التحويل لابد من التأكد من أن التحويل في صالح العملاء، ثم ضمان أن من سيحولون إليه متخصص وحسن السمعة ومؤهل لتقديم الخدمة المطلوبة.",
        "في الحالات التي يظهر فيها عدم رضى العملاء من مستوى أو كفاية الخدمة، لابد من إحاطتهم بأنه من حقهم إبداء ذلك بشكل رسمي من خلال كتابة تذمر أو شكوى.",
        "صياغة العدالة الاجتماعية، وتحقيق الاستقلال خلال العمل في تنمية المجتمعات، سواء مع جماعات العملاء أو مع المجتمعات.",
        "تشجيع وتمكين العملاء على تقويم الاستشارة بدون طلب من المستشار مع الاستفادة من ذلك.",
        "تحمل الواجب المهني بكل أمانة وإخلاص، مع تجنب الاستشارة من أي ضرر ينتهك أخلاقياتها، أو يقلل من شرفها كخدمة إنسانية.",
        "على المستشار إظهار مؤهلاته وتخصصاته وقدراته وخبراته وإنجازاته وعضويتهم بشكل دقيق وصادق وأمين.",
        "عدم استغلال العلاقة المهنية أثناء الاستشارة في تحقيق أغراض شخصية، سواء عمداً أو حتى بطرق غير واعية أو غير مقصودة.",
        "ممارسة الاستشارة بشكل واعٍ تظهر من خلاله المعرفة النظرية، والكفاءة في المهارات العملية، بما يضمن تقديم مستوى عالٍ من الخدمة في ظل المسئولية المهنية.",
        "تقديم الاستشارة في حقل التخصص بناءً على الدرجة العلمية أو التخصص العلمي أو التدريب العملي.",
        "اتخاذ العمل والإجراء المناسب في حالات عدم حضور الجلسة أو التخلف عنها، مما يحول دون تقديم الخدمة المطلوبة، وإبلاغ العميل بذلك، وإبلاغ المنصة التي تقدم الاستشارة مع توضيح الأسباب.",
        "تقديم مصلحة العملاء ووضعها في المقام الأفضل والمتقدم على أي مصلحة أخرى، مع مراعاة عدم الإضرار بمصالح الآخرين.",
        "حماية حقوق ومصالح العملاء الغير قادرين أو الغير مؤهلين لاتخاذ القرار، وكل من هم في حاجة إلى اتخاذ قرار نيابة عنهم، وبما يخدم مصلحتهم.",
        "يجب تجنب المواقف التي تتعارض فيها مصالح العملاء مع مصالح أخرى. كما يجب إحاطة العملاء حينما تكون هناك احتمالية وقوع تضارب في المصالح، ثم اتخاذ ما يلزم لتجنيب المواقف من التضارب، مع وضع مصلحة العميل في الأولوية.",
        "ليس من حق المستشار أن يجني أي منفعة غير دفع رسوم وقيمة الاستشارة أو حتى تحقيق أي استغلال شخصي، أو ديني، أو سياسي، أو تجاري من آخرين.",
        "تجنب العلاقات المهنية المتعددة أو المزدوجة التي تكون فيها فرص الاستغلال كبيرة الاحتمال أو غير مأمونة، مع اتخاذ الخطوات اللازمة لحماية العملاء وحقوقهم وحماية حدود ممارسة الاستشارة بشكل مهني، وصيانة أهدافها النبيلة.",
        "في حالات تقديم استشارات مع حالات الخلافات العائلية لابد من إدراك نقطة تعارض المصالح بين أفراد العائلة، إذ على الممارس أن يسعى إلى توضيح ذلك لدى الأعضاء، ثم السعي الحثيث نحو تقليل تضارب المصالح.",
        "لابد من احترام حقوق العملاء في المحافظة على معلوماتهم الخاصة. المعلومات الخاصة والسرية يجب ألاّ تطلب، إلاّ من أجل العمل المهني وفيما يخدم جانب العملاء، وبالتالي يجب صيانتها والمحافظة عليها وفقاً لما ينص عليه الدستور الأخلاقي.",
        "لا يمكن إشاعة أي معلومة سرية تخص العميل، إلاّ بعد أخذ الموافقة الرسمية منه بذلك أو من ينوب عنه في الحالات التي فيها من ينوب عنه.",
        "لا يتم استخدام الاستشارة بالبيانات الأصلية الخاصة بها في التسويق والتدريب حتى لو وافق العميل على ذلك.",
        "جميع المعلومات المحصول عليها من العملاء يجب المحافظة عليها سرياً من أجل الاستشارة.",
        "مع حالات الإرشاد الزواجي والأسري والجماعي، لابد من إحاطة جميع الأطراف بضرورة التوقيع على تعهد المحافظة على سرية المعلومات، التي ستتداول أثناء الجلسات، مع التنويه إلى أن المستشار لا يمكنه ضمان التزام الجميع بذلك الميثاق.",
        "على المستشار أن يمتنع عن الدخول في المحاكم والشهود في قضايا أسرية مع أي طرف من طالبي الاستشارة.",
        "على المستشار التأكد من أمان وسرية الأدوات والوسائل المستخدمة، كالكمبيوتر والهاتف والفاكس وما شابهها.",
        "على المستشار أن يمتنع أن يقدم تحليل لاستشارات فردية في وسائل التواصل الاجتماعي والمساحات للتسويق أو غيره.",
        "يجب على المستشار والمنصة التي تقدم خدمات المستشار أن تعرض الخدمة بشكل واضح وصريح أمام العملاء، مع وضع حدود العمل المهني، ثم توضيح الغرض والغاية من الخدمة، وجوانب الخطر، ومحدودية الخدمة وضوابطها، والخيارات المتاحة، وحق العملاء في رفض الخدمة أو سحب القبول، والوقت المحدد لذلك، مع إتاحة الفرصة للعملاء للاستيضاح وطرح التساؤلات.",
        "أخذ موافقة العملاء عند الحاجة إلى تسجيل الجلسة الاستشارية بجهاز الفيديو أو الكاسيت، وكذلك عند الحاجة إلى وجود شخص ثالث، سواء كان متخصصاً أو متدرباً أو باحثاً.",
        "على المستشار تقبل واحترام العملاء بشكل لائق، وعدم استخدام أي لغة تحقيرية أو تهكمية خلال المحادثة والتعامل.",
        "في الحالات التي يتعين فيها دفع مقابل مادي للخدمات المقدمة –كالممارسة في العيادات الخاصة– على الممارس المهني التأكد من أن الدفع يتناسب مع الخدمة، ومع قدرات العملاء المادية، وفقاً للوضع الاقتصادي في المجتمع دونما استغلال.",
        "على المستشار عدم قبول الهدايا أو المنح من العملاء، تحت أي مسمى لأن ذلك سيعمل على تحطيم حدود العلاقة المهنية بين المستشار والمستفيد.",
        "في حال توقف المستشار عن العمل في منصة الاستشارة عن بعد أو انتقاله إلى عمل آخر، لابد أن يحيط عملائه بشكل واضح ودقيق، تاركاً لهم حرية الاختيار بين التحويل لمستشار آخر، أو التوقف عن استلام الخدمات، مع تقدير الموقف، وحال العميل بشكل واضح، يكفل حقوق العملاء ويضمن أولوياتهم."
    ];

    const handleReject = () => {
        router.push("/");
    };

    const handleAccept = () => {
        if (!agree) return;
        startTransition(() => {
            confirmOathAcceptance(id).then((response) => {
                if (response) {
                    router.refresh()
                } else {
                    ZToast({ state: false, message: "حدث خطأ ما" })
                }
            });
        });
    };

    return (
        <div dir="rtl" className="max-w-3xl mx-auto py-10 px-4 space-y-6">
            <h3 className="text-zblue-200 text-2xl font-bold">
                ميثاق شاورني للاستشارات
            </h3>
            <p className="text-sm text-gray-600">
                ترجع أهمية الميثاق المهني والأخلاقيات للاستشارات الى عدة فوائد ...
            </p>
            <Separator />
            <h6 className="text-base font-semibold">معايير وقواعد واخلاقيات الاستشارات:</h6>
            <ul className="list-disc px-4 space-y-2">
                {terms.map((t, i) => (
                    <li key={i} className="text-sm leading-relaxed">{t}</li>
                ))}
            </ul>
            <Separator />

            <div className="flex items-center gap-3">
                <Checkbox checked={agree} onCheckedChange={() => setAgree(!agree)} />
                <Label className="text-black text-sm">الموافقة على الميثاق المهني</Label>
            </div>

            <div className="flex justify-between pt-6">
                <Button
                    onClick={handleAccept}
                    disabled={!agree || isPending}
                    className="gap-2 bg-zblue-200 text-base"
                >
                    <LoadingBtn loading={isPending}>
                        <Save className="w-5 h-5" /> موافقة
                    </LoadingBtn>
                </Button>

                <Button
                    onClick={handleReject}
                    variant="destructive"
                    disabled={isPending}
                    className="gap-2 text-base"
                >
                    <Ban className="w-5 h-5" /> عدم الموافقة
                </Button>
            </div>

            <div className='rflex gap-2'>
                <TriangleAlert className='w-5 text-amber-500' />
                <h6 className='text-base text-amber-500 font-medium'>عدم الموافقة يعرض حسابك للإيقاف</h6>
            </div>
        </div>
    );
}

export default ConsultantOath;